content/music.md
+++
title = "Music"
author = ["Florian Posdziech"]
draft = false
+++

## All things music {#all-things-music}

I play the trombone for [The Uplifters &amp; Block Ice Horn Section](https://theuplifters.de/) from Freiburg and [The Offbeat Service](https://www.instagram.com/theoffbeatservice/) from Worms.


### Upcoming concert dates {#upcoming-concert-dates}

-   **9 May 2026** @ [Alter](https://www.alter-mannheim.de/), Mannheim with _The Uplifters_. ([Info](https://theuplifters.de/news/9-mai-2026-alter-mannheim/))
-   **11 July 2026** @ [Open Air Hamm](https://www.open-air-hamm.de/) with _The Offbeat Service_.
-   **24 October 2026** @ [Alte Hackerei](https://altehackerei.de/), Karlsruhe with _The Offbeat Service_. (Support for [Wisecräcker](https://wisecracker.de/))


#### 2025 {#2025}

-   13 December @ [Funzel](https://www.instagram.com/diefunzel), Worms with _The Offbeat Service_.
-   13 September @ Altstadtfest Speyer with _The Uplifters_. ([Info](https://theuplifters.de/news/altstadtfest-speyer-13-09-am-nagelklotz/))
-   16 August @ [Worms: jazz and joy](https://www.jazzandjoy.de/) with _The Offbeat Service_.
-   20 July @ Fancy Farm, Kirchzeiten with _The Uplifters_.
-   5 July @ [Alter](https://www.alter-mannheim.de/), Mannheim with _The Uplifters_.
-   30 April @ Wilhelmsplatz, Heidelberg with _Marshall Pfefferle_.
-   15 February @ [Jos Fritz](https://josfritzfreiburg.de/), Freiburg with _The Uplifters_.


#### 2024 {#2024}

-   tbc...
